app/controllers/goals_controller.rb

  def index
    @user=User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def edit
    @user=User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def update
    @user = User.find params[:id]
    @user.update_attributes!(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "pullups" = 15, "pushups" = 25, "situps" = 30, "squats" = 24, "dips" = 12, "updated_at" = '2012-06-28 09:32:29.404359' WHERE "users"."id" = 1