app/controllers/pullups_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "pullups".* FROM "pullups" WHERE "pullups"."user" = 'Borat'
SELECT "pullups".* FROM "pullups"
---
  def index
      @pull_counts=[]
      @goal_counts=[]
      @pull_date=[]


      @user=User.find_by_id(session[:user_id])
      #flash[:notice] ="Hi, #{@user.name} !"
      @allpullups = Pullup.find(:all, :conditions => { :user => @user.name})

      @allpullups.each do |elm|

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def new
    @user=User.find_by_id(session[:user_id])

INSERT INTO "pullups" ("count", "created_at", "note", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["count", "33"], ["created_at", Mon, 25 Jun 2012 10:23:20 UTC +00:00], ["note", "wwwwwwweeeee"], ["updated_at", Mon, 25 Jun 2012 10:23:20 UTC +00:00], ["user", "Alhen"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def create
    @pull = Pullup.create!(params[:pull])
    flash[:notice] = "#{@pull.user}, your count of #{@pull.count} was successfully recorded."

SELECT "pullups".* FROM "pullups" WHERE "pullups"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @pull = Pullup.find params[:id]

SELECT "pullups".* FROM "pullups" WHERE "pullups"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "pullups" SET "count" = '23', "note" = 'week', "updated_at" = '2012-06-28 06:54:37.427393' WHERE "pullups"."id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def update
    @pull = Pullup.find params[:id]
    @pull.update_attributes!(params[:pull])
    flash[:notice] = "#{@pull.user}, your record of '#{@pull.count}' was successfully updated."

SELECT "pullups".* FROM "pullups" WHERE "pullups"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "pullups" WHERE "pullups"."id" = ?  [["id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def destroy
    @pull = Pullup.find(params[:id])
    @pull.destroy
    flash[:notice] = "'#{@pull.user}' your record of '#{@pull.count}' was deleted."