app/controllers/pushups_controller.rb

  def index
    @push_counts=[]
    @goal_counts=[]
    @push_date=[]

    @user=User.find_by_id(session[:user_id])
    #flash[:notice] ="Hi, #{@user.name} !"
    @allpushups = Pushup.find(:all, :conditions => { :user => @user.name})

    @allpushups.each do |elm|
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "pushups".* FROM "pushups" WHERE "pushups"."user" = 'Alhen' LIMIT 1
SELECT "pushups".* FROM "pushups"

  def new
    @user=User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def create
    @push = Pushup.create!(params[:push])
    flash[:notice] = "#{@push.user}, your count of #{@push.count} was successfully recorded."
---
INSERT INTO "pushups" ("count", "created_at", "note", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["count", "21"], ["created_at", Fri, 22 Jun 2012 08:02:41 UTC +00:00], ["note", ""], ["updated_at", Fri, 22 Jun 2012 08:02:41 UTC +00:00], ["user", "Alhen"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def edit
    @push = Pushup.find params[:id]
---
SELECT "pushups".* FROM "pushups" WHERE "pushups"."id" = ? LIMIT 1  [["id", "12"]]

  def update
    @push = Pushup.find params[:id]
    @push.update_attributes!(params[:push])
    flash[:notice] = "#{@push.user}, your record of '#{@push.count}' was successfully updated."
---
SELECT "pushups".* FROM "pushups" WHERE "pushups"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "pushups" SET "count" = '12', "updated_at" = '2012-06-22 08:03:20.682258' WHERE "pushups"."id" = 12
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def destroy
    @push = Pushup.find(params[:id])
    @push.destroy
    flash[:notice] = "'#{@push.user}' your record of '#{@push.count}' was deleted."
---
SELECT "pushups".* FROM "pushups" WHERE "pushups"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "pushups" WHERE "pushups"."id" = ?  [["id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1