app/controllers/static_controller.rb

    def index
      @allpushups = Pushup.all
---
SELECT "pushups".* FROM "pushups"