app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "dips", "name", "password_digest", "pullups", "pushups", "situps", "squats", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "password_digest" = '$2a$10$bhAObu7QFKVCEIoZWsT/I.2u8aICp5LnNrK3QxmYQiWb8/sr4Vboa', "updated_at" = '2012-06-24 01:48:56.187681' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])